package com.javaonlinecourse.b2lesson1.homework.hw03;

/**
 * Создать в пакете hw03
 *
 * Класс Soldier (Солдат) с 5 конструкторами
 * Имя
 * Имя Возраст
 * Имя Возраст Звание
 * Имя Возраст Звание Рост
 * Имя Возраст Звание Рост ГруппаКрови
 *
 *
 * Создать класс Circle с 3 конструкторами:
 * X, Y, radius
 * X, Y, radius, width
 * X, Y, radius, width, color
 *
 *
 * Класс Rectangle (прямоугольник). Создать для него как можно больше конструкторов
 * Поля класса int top, int left, int width, int height (левая координата, верхняя, ширина и высота)
 * Примеры:
 * заданы 4 параметра: left, top, width, height
 * ширина/высота не задана (оба равны 0)
 * высота не задана (равно ширине) создаём квадрат
 * создаём копию другого прямоугольника (он и передаётся в параметрах)
 */
public class HW06 {
}
