package com.javaonlinecourse.b1lesson1.homework;

/**
 * Вычислить объем пирамиды, основанием которой является треугольник, для значений А, В, С и Н данных в контрольном
 * примере.  Для вычисления площади основания использовать формулу Герона (найти в интернете).
 * Контрольный пример:  A=3, B=4, C=5, H=6. Результат V=12.
 */
public class HW01 {
    public static void main(String[] args) {
        double a,b,c,h;
        int kk;
        System.out.println( /* вывести результат - это кстати комментарий */ );
    }
}
