package com.javaonlinecourse.b1lesson1.homework;

/**
 * Дана длина ребра куба. Вычислить объем куба и площадь его боковой поверхности.
 * Данные взять из контрольного примера.
 * Контрольный пример: A=5. Результат: V=125, S=100.
 */
public class HW03 {
    public static void main(String[] args) {
        int a, V, s;
        System.out.println( /* вывести результат */);
    }
}
