package com.javaonlinecourse.b2lesson2.homework.hw03;

/**
 *  Написать четыре метода void print с разными параметрами.
 *  Метод использует System.out.println()
 */
public class HomeTask02 {
}
