package com.javaonlinecourse.b2lesson1.homework.hw01;

/**
 * Создайте классы Cat(кот), Dog(собака), Hamster(хомяк), Human(человек) в пакете hw01
 * В каждом классе объявите поле name(имя), age(возраст). Подумайте какими типами они могут являться
 * В каждом классах Cat, Dog, Hamster объявите поле с именем owner. Подумайте каким типом оно может являться
 * Создайте класс Main в пакете hw01, в котором создайте объекты Cat, Dog, Hamster, Human.
 * Присвойте каждому животному владельца (owner).
 */
public class HW01 {

}
