package com.javaonlinecourse.b1lesson4.homework;

import java.util.Random;

/**
 * @author emitrohin
 * @version 1.0
 *          12.11.2016
 * Реализовать метод, проверяющий и сообщающий на экран,
 * является ли целое число чётным либо нечётным.
 */
public class HW03 {
    public static void main(String[] args) {

        int n = 10;
        if (n % 2 == 0)

            System.out.println("Четное");
        else
            System.out.println("Нечетное");
        }

}
