package com.javaonlinecourse.b2lesson2.homework.hw02;

/**
 * Создай класс Human с полями
 * имя(String), пол(boolean),возраст(int), отец(Human), мать(Human).
 * Создай объекты и заполни их так, чтобы получилось:
 * 2 деда, 2 бабки, 1 папа, 1 мама, четверо детей у мамы и папы.
 * Вывести людей на экран.
 *
 * римечание:
 * Если написать свой метод String toString() в классе Human, то именно он будет использоваться при выводе объекта на экран.
 *
 * Пример вывода:
 * Имя: Ася, пол: женский, возраст: 35, папа: Григорий, мама: Елизавета
 * Имя: Олег, пол: мужской, возраст: 76
 * Имя: Николай, пол: мужской, возраст: 5, отец: Анатолий, мать: Ольга
 */
public class HomeTask05 {
    public class Human{

    }

    public static void main(String[] args) {

    }
}
